In [1]:
import pandas as pd

# 建立 dataframe

In [2]:
# 新增一個二維 list
list_students = [
    ['Alex', 19],
    ['Bill', 22],
    ['Carl', 14],
    ['Darren', 18]
]

# 建立基本的 dataframe
df = pd.DataFrame(list_students)

# 設定 dataframe 的欄位
df.columns = ['name', 'age']; df

     name  age
0    Alex   19
1    Bill   22
2    Carl   14
3  Darren   18

In [3]:
# 使用 dict 來建立 dataframe
df = pd.DataFrame({
    'name': ['Alex', 'Bill', 'Carl', 'Darren'],
    'age': [19, 22, 14, 18]
}); df

     name  age
0    Alex   19
1    Bill   22
2    Carl   14
3  Darren   18

In [4]:
# 使用 list of dict 來建立 dataframe
data = [
    {'name': 'Alex', 'age': 19},
    {'name': 'Bill', 'age': 22},
    {'name': 'Carl', 'age': 14},
    {'name': 'Darren', 'age': 18},
]

df = pd.DataFrame(data); df

     name  age
0    Alex   19
1    Bill   22
2    Carl   14
3  Darren   18

In [5]:
'''建立「2020 ~ 2023」年「臺北、臺中、高雄」某月平均溫度 的 dataframe'''

# 建立欄位
years = range(2020, 2024)

# 臺北、臺中、高雄 某個月的平均溫度
taipei = pd.Series([20, 21, 19, 21], index=years)
taichung = pd.Series([25, 26, 27, 28], index=years)
kaohsiung = pd.Series([30, 29, 31, 32], index=years)

# 建立 dataframe (axis=0 是上下合併，axis=1 是左右合併)
df = pd.concat([taipei, taichung, kaohsiung], axis=1)

# 設定欄位
df.columns = ['taipei', 'taichung', 'kaohsiung']; df

      taipei  taichung  kaohsiung
2020      20        25         30
2021      21        26         29
2022      19        27         31
2023      21        28         32